FireVirtuozz/ESP32/server/components/sensorsLib/sensorsLib.c
    //data frame of 2 bytes
    //bit 15 : reset to default
    //9-11 : AVG
    //6-8 : Vbus CT
    //3-5 : Vsh CT
    //0-2 : Mode
    //default : 01000001 00100111
    uint16_t cfg_frame = 0;
    cfg_frame |= 1 << 15; //reset bit

    uint8_t buf_cfg[3] = {
        0x00,                    //config register
        (cfg_frame >> 8) & 0xFF, //MSB
        cfg_frame & 0xFF         //LSB
    };
    err = i2c_master_transmit(ina_handle, buf_cfg, 3, -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) transmitting config frame", esp_err_to_name(err));
        return err;
    }

    //wait 2ms for reset
    vTaskDelay(pdMS_TO_TICKS(2));

    //calibration: CAL = 0.00512 / (Current_LSB * Rshunt)
    // Current_LSB = MaxCurrent / 2^15
    // --> I = U/R = 0.08192 / 0.1
    // --> Current_LSB = 0.000025
    // --> CAL = 2048
    uint16_t cal_frame = 2048;

    uint8_t buf_cal[3] = {
        0x05,                    //config register
        (cal_frame >> 8) & 0xFF, //MSB
        cal_frame & 0xFF         //LSB
    };
    err = i2c_master_transmit(ina_handle, buf_cal, 3, -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) transmitting calibration frame", esp_err_to_name(err));
        return err;
    }

    log_msg(TAG, "INA226 initialized");

    return ESP_OK;
    
}

esp_err_t get_ina_info(ina_info_t *ina_info) {
    if (ina_info == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (ina_queue == NULL) {
        return ESP_ERR_INVALID_STATE;
    }

    esp_err_t err;

    //reading (ack each frame)
    //start master
    //frame 1 : slave adress byte
    //frame 3 : data MSB
    //frame 4 : data LSB
    //stop master

    //change register pointer, write new register to read
    uint8_t reg_ptr[1] = {0x01};
    uint8_t buf_rec[2];

    //shunt voltage
    err = i2c_master_transmit_receive(ina_handle, reg_ptr, 1,
        buf_rec, sizeof(buf_rec), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) receiving shunt", esp_err_to_name(err));
        return err;
    }
    ina_info->shunt = ((uint16_t)buf_rec[0] << 8) | buf_rec[1];

    //bus voltage
    reg_ptr[0] = 0x02;
    err = i2c_master_transmit_receive(ina_handle, reg_ptr, 1,
        buf_rec, sizeof(buf_rec), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) receiving bus", esp_err_to_name(err));
        return err;
    }
    ina_info->bus = ((uint16_t)buf_rec[0] << 8) | buf_rec[1];

    //power
    reg_ptr[0] = 0x03;
    err = i2c_master_transmit_receive(ina_handle, reg_ptr, 1,
        buf_rec, sizeof(buf_rec), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) receiving power", esp_err_to_name(err));
        return err;
    }
    ina_info->power = ((uint16_t)buf_rec[0] << 8) | buf_rec[1];

    //current
    reg_ptr[0] = 0x04;
    err = i2c_master_transmit_receive(ina_handle, reg_ptr, 1,
        buf_rec, sizeof(buf_rec), -1);
    if (err != ESP_OK) {
        log_msg(TAG, "Error (%s) receiving current", esp_err_to_name(err));
        return err;
    }
    ina_info->current = ((uint16_t)buf_rec[0] << 8) | buf_rec[1];

    return ESP_OK;
}

/**
 * Periodic INA monitoring task
 */
static void ina_task(void * params) {
    esp_err_t err;
    ina_info_t ina_info;

    err = init_ina();
    if (err != ESP_OK){
        return;
    }

    while (monitoring)
    {
        err = get_ina_info(&ina_info);

        if (err == ESP_OK) {
            xQueueSend(ina_queue, &ina_info, 0);
        }

        vTaskDelay(pdMS_TO_TICKS(INA_PERIOD));
    }
    return;
}

#endif

#if CONFIG_USE_KY003

#define KY_GPIO 34
#define KY_PERIOD 10

#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "soc/soc_caps.h"

// Variables globales pour le driver
static adc_oneshot_unit_handle_t adc1_handle = NULL;
static adc_cali_handle_t adc1_cali_handle = NULL;

// Choisis ton canal (ADC1_CHANNEL_6 est sur le GPIO 34)
#define HALL_ADC_CHANNEL ADC1_CHANNEL_6

static volatile ky_info_t ky_info = {0};
static QueueHandle_t ky_queue = NULL;

static void print_ky(ky_info_t *ky) {
    if (ky->signal_duration == 0) {
        log_msg(TAG, "[mean]; tr/s : 0.000, v: 0.000km/h (Stopped), count: %d",
            ky->signal_count);
        return;
    }

    // On utilise ky->signal_duration qui est déjà la moyenne des deltas de la fenêtre
    double duration_s = ky->signal_duration * 1e-6;
    double tr_per_s = 1.0 / duration_s;
    double v_ms = 3.14159 * 6.75e-2 * tr_per_s;
    double v_kmh = v_ms * 3.6;

    log_msg(TAG, "[mean]; tr/s : %.3f, v: %.3fm/s, v: %.3fkm/h, count: %d",
        tr_per_s, v_ms, v_kmh, ky->signal_count);
}

/**
 * Initialize KY
 */
esp_err_t init_ky() {

    esp_err_t err;

    if (ky_queue != NULL) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "KY already initialized");
        return ESP_ERR_INVALID_STATE;
    }
    ky_queue = xQueueCreate((MONITOR_PERIOD / KY_PERIOD) + 2, sizeof(ky_info_t));
    if (ky_queue == NULL) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "Error creating KY queue");
        return ESP_ERR_NOT_ALLOWED;
    }

    ky_info.signal_count = 0;
    ky_info.signal_duration = 0;

    // 1. Init unité ADC1
    adc_oneshot_unit_init_cfg_t init_config = {
        .unit_id = ADC_UNIT_1,
        .ulp_mode = ADC_ULP_MODE_DISABLE,
    };
    err = adc_oneshot_new_unit(&init_config, &adc1_handle);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "adc_oneshot_new_unit failed: %s", esp_err_to_name(err));
        return err;
    }

    // 2. Config canal (GPIO34 = ADC1_CHANNEL_6 sur ESP32)
    adc_oneshot_chan_cfg_t chan_config = {
        .bitwidth = ADC_BITWIDTH_DEFAULT,
        .atten = ADC_ATTEN_DB_12,   // 0~3.1V
    };
    err = adc_oneshot_config_channel(adc1_handle, ADC_CHANNEL_6, &chan_config);
    if (err != ESP_OK) {
        log_msg_lvl(ESP_LOG_ERROR, TAG, "adc_oneshot_config_channel failed: %s", esp_err_to_name(err));
        return err;
    }

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    adc_cali_curve_fitting_config_t cali_config = {
        .unit_id = ADC_UNIT_1,
        .atten = ADC_ATTEN_DB_12,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    err = adc_cali_create_scheme_curve_fitting(&cali_config, &adc1_cali_handle);
#else
    // 3. Calibration (line fitting, ESP32 classique)
    adc_cali_line_fitting_config_t cali_config = {
        .unit_id = ADC_UNIT_1,
        .atten = ADC_ATTEN_DB_12,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    err = adc_cali_create_scheme_line_fitting(&cali_config, &adc1_cali_handle);
#endif

    if (err != ESP_OK) {
        // Pas bloquant, on continue sans calibration
        log_msg_lvl(ESP_LOG_WARN, TAG, "Calibration non disponible: %s", esp_err_to_name(err));
        adc1_cali_handle = NULL;
    }

    log_msg(TAG, "KY-003 initialized");

    return ESP_OK;
}

/**
 * Get signal of KY-003.
 * This function should be polled.
 * @returns KY info structure, or NULL if error
 */
ky_info_t* get_signal_info() {
    if (ky_queue == NULL) {
        return NULL;
    }

    static int64_t last_timestamp = 0;
    static uint8_t last_lvl = 1;

    int64_t now = esp_timer_get_time();

    uint8_t lvl = gpio_get_level(KY_GPIO);

