FireVirtuozz/ESP32/server/components/sensorsLib/sensorsLib.c
    err = convert_pressure(&mpu_info->pressure);
    if (err != ESP_OK) return err;

    //other formulas on datasheet

    return ESP_OK;
}

/**
 * 50 ms monitoring MPU task
 */
static void mpu_task(void * params) {
    esp_err_t err;
    mpu_info_t mpu_info;

    err = init_mpu();
    if (err != ESP_OK){
        return;
    }

    while (monitoring)
    {
        err = get_mpu_info(&mpu_info);

        if (err == ESP_OK) {
            xQueueSend(mpu_queue, &mpu_info, 0);
        }

        vTaskDelay(pdMS_TO_TICKS(MPU_PERIOD));
    }
    return;
}

#endif

static void monitoring_task(void* params) {

    uint16_t count = 0;
    BaseType_t res;

#if CONFIG_USE_HCSR04
    int64_t echo_temp = 0, echo_res = 0;
    res = xTaskCreate(hc_task, "hc_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg(TAG, "Error (%d) creating HC monitoring task", res);
        return;
    }
#endif

#if CONFIG_USE_INA226
    ina_info_t ina = {0}, ina_temp;
    res = xTaskCreate(ina_task, "ina_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg(TAG, "Error (%d) creating INA monitoring task", res);
        return;
    }
#endif

#if CONFIG_USE_MPU9250
    mpu_info_t mpu = {0}, mpu_temp;
    res = xTaskCreate(mpu_task, "mpu_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg(TAG, "Error (%d) creating mpu monitoring task", res);
        return;
    }
#endif

#if CONFIG_USE_KY003
esp_err_t err;
   err = init_ky();
    if (err != ESP_OK){
        return;
    }
    ky_info_t ky = {0}, ky_temp;
    res = xTaskCreate(ky_task, "ky_monitoring", 2048, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg(TAG, "Error (%d) creating KY monitoring task", res);
        return;
    }
#endif

#if CONFIG_USE_WIFI

#if CONFIG_USE_UDPLIB
    uint8_t frame_size = sizeof(header_udp_frame_t);
    header_udp_frame_t frame = {0};
#else
#if CONFIG_USE_ESPNOW
    uint8_t frame_size = sizeof(header_espnow_frame_t);
    header_espnow_frame_t frame = {0};
#endif
#endif

#if CONFIG_USE_KY003
    frame_size += sizeof(ky_info_t);
#endif
#if CONFIG_USE_HCSR04
    frame_size += sizeof(int64_t);
#endif
#if CONFIG_USE_MPU9250
    frame_size += sizeof(mpu_info_t);
#endif
#if CONFIG_USE_INA226
    frame_size += sizeof(ina_info_t);
#endif
    uint8_t frame_buf[frame_size];

#if CONFIG_USE_KY003
    frame.flags |= 1 << 0;
#endif
#if CONFIG_USE_HCSR04
    frame.flags |= 1 << 1;
#endif
#if CONFIG_USE_MPU9250
    frame.flags |= 1 << 2;
#endif
#if CONFIG_USE_INA226
    frame.flags |= 1 << 3;
#endif

    frame.type = 0; //monitor frame type
    frame.timestamp = (uint32_t)(esp_timer_get_time() / 1000);

    while (monitoring)
    {
        uint8_t offset_frame = 0;
        frame_buf[offset_frame] = frame.type;
        offset_frame++;
        frame_buf[offset_frame] = frame.flags;
        offset_frame++;
        memcpy(&frame_buf[offset_frame], &frame.timestamp, sizeof(uint32_t));
        offset_frame += sizeof(uint32_t);
        
    #if CONFIG_USE_KY003
        int signals_in_this_window = 0;
        if (ky_queue != NULL) {
            int64_t total_duration = 0;

            while (xQueueReceive(ky_queue, &ky_temp, 0) == pdTRUE) {
                signals_in_this_window++;
                total_duration += ky_temp.signal_duration;
            }

            if (signals_in_this_window > 0) {
                // VRAIE MOYENNE : Somme des temps / nombre d'impulsions
                ky.signal_duration = total_duration / signals_in_this_window;
                ky.signal_count += signals_in_this_window; // Cumul total
            } else {
                // Optionnel : si on n'a rien reçu, la vitesse est peut-être 0
                ky.signal_duration = 0; 
            }
            //log_msg(TAG, "count window: %d", signals_in_this_window);
        }
        print_ky(&ky);
        memcpy(&frame_buf[offset_frame], &ky.signal_count, sizeof(ky.signal_count));
        offset_frame += sizeof(ky.signal_count);
        memcpy(&frame_buf[offset_frame], &ky.signal_duration, sizeof(ky.signal_duration));
        offset_frame += sizeof(ky.signal_duration);
    #endif

    #if CONFIG_USE_HCSR04
        if (hc_queue != NULL && uxQueueMessagesWaiting(hc_queue) > 0) {
            echo_res = 0;
            count = 0;
            while (xQueueReceive(hc_queue, &echo_temp, 0) == pdTRUE) {
                echo_res += echo_temp;
                count++;
            }
            if (count > 0) {
                echo_res /= count;
            }
        }
        print_hc(echo_res);
        memcpy(&frame_buf[offset_frame], &echo_res, sizeof(int64_t));
        offset_frame += sizeof(int64_t);

    #endif
    
    #if CONFIG_USE_MPU9250
        if (mpu_queue != NULL && uxQueueMessagesWaiting(mpu_queue) > 0) {
            int32_t ax=0,ay=0,az=0,gx=0,gy=0,gz=0,tm=0,tb=0,p=0;
            count = 0;
            while (xQueueReceive(mpu_queue, &mpu_temp, 0) == pdTRUE) {
                ax += mpu_temp.accel_x;
                ay += mpu_temp.accel_y;
                az += mpu_temp.accel_z;
                gx += mpu_temp.gyro_x;
                gy += mpu_temp.gyro_y;
                gz += mpu_temp.gyro_z;
                tm += mpu_temp.temp_mpu;
                tb += mpu_temp.temp_bmp;
                p  += mpu_temp.pressure;
                count++;
            }
            if (count > 0) {
                mpu.accel_x  = ax / count;
                mpu.accel_y  = ay / count;
                mpu.accel_z  = az / count;
                mpu.gyro_x   = gx / count;
                mpu.gyro_y   = gy / count;
                mpu.gyro_z   = gz / count;
                mpu.temp_mpu = tm / count;
                mpu.temp_bmp = tb / count;
                mpu.pressure = p  / count;
            }
        }
        print_mpu(&mpu);
        memcpy(&frame_buf[offset_frame], &mpu.accel_x, sizeof(mpu.accel_x));
        offset_frame += sizeof(mpu.accel_x);
        memcpy(&frame_buf[offset_frame], &mpu.accel_y, sizeof(mpu.accel_y));
        offset_frame += sizeof(mpu.accel_y);
        memcpy(&frame_buf[offset_frame], &mpu.accel_z, sizeof(mpu.accel_z));
        offset_frame += sizeof(mpu.accel_z);
        memcpy(&frame_buf[offset_frame], &mpu.gyro_x, sizeof(mpu.gyro_x));
        offset_frame += sizeof(mpu.gyro_x);
        memcpy(&frame_buf[offset_frame], &mpu.gyro_y, sizeof(mpu.gyro_y));
        offset_frame += sizeof(mpu.gyro_y);
        memcpy(&frame_buf[offset_frame], &mpu.gyro_z, sizeof(mpu.gyro_z));
        offset_frame += sizeof(mpu.gyro_z);
        memcpy(&frame_buf[offset_frame], &mpu.temp_mpu, sizeof(mpu.temp_mpu));
        offset_frame += sizeof(mpu.temp_mpu);
        memcpy(&frame_buf[offset_frame], &mpu.pressure, sizeof(mpu.pressure));
        offset_frame += sizeof(mpu.pressure);
        memcpy(&frame_buf[offset_frame], &mpu.temp_bmp, sizeof(mpu.temp_bmp));
        offset_frame += sizeof(mpu.temp_bmp);

    #endif

    #if CONFIG_USE_INA226
        if (ina_queue != NULL && uxQueueMessagesWaiting(ina_queue) > 0) {
            int32_t sh=0, bu=0, cu=0, po=0;
            count = 0;
            while (xQueueReceive(ina_queue, &ina_temp, 0) == pdTRUE) {
                sh += ina_temp.shunt;
                bu += ina_temp.bus;
                cu += ina_temp.current;
                po += ina_temp.power;
                count++;
            }
            if (count > 0) {
                ina.shunt   = sh / count;
                ina.bus     = bu / count;
                ina.current = cu / count;
                ina.power   = po / count;
            }
        }
        print_ina(&ina);
        memcpy(&frame_buf[offset_frame], &ina.bus, sizeof(ina.bus));
        offset_frame += sizeof(ina.bus);
        memcpy(&frame_buf[offset_frame], &ina.current, sizeof(ina.current));
        offset_frame += sizeof(ina.current);
        memcpy(&frame_buf[offset_frame], &ina.power, sizeof(ina.power));
        offset_frame += sizeof(ina.power);
        memcpy(&frame_buf[offset_frame], &ina.shunt, sizeof(ina.shunt));
        offset_frame += sizeof(ina.shunt);
    #endif

    #if CONFIG_USE_UDPLIB
        send_udp_msg(frame_buf, frame_size);
    #else
    #if CONFIG_USE_ESPNOW
        send_espnow_msg(frame_buf, frame_size);
    #endif
    #endif

        vTaskDelay(pdMS_TO_TICKS(MONITOR_PERIOD));
    }
    #endif
    return;
}

//maybe timerTask is better?

esp_err_t start_monitoring_task() {

    if (monitoring) {
        return ESP_ERR_INVALID_STATE;
    }
    monitoring = true;
    BaseType_t res = xTaskCreate(monitoring_task, "sensors_monitoring", 8196, NULL, 5, NULL);
    if (res != pdPASS) {
        log_msg(TAG, "Error (%d) create monitoring task", res);
        return ESP_ERR_NOT_ALLOWED;
    }
    log_msg(TAG, "Monitoring task created");
    return ESP_OK;
}